; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v4)
		(pred_2 ?v5)
		(pred_3 ?v7)
		(pred_5 ?v7)
		(pred_4 ?v5 ?v7)
		(pred_6)
		(pred_1 ?v5))

   (:action op_3
       :parameters  (?v1 ?v8)
       :precondition (and (not-eq ?v1 ?v8) 
                          (pred_3 ?v1) (pred_3 ?v8) (pred_5 ?v1))
       :effect (and  (pred_5 ?v8)
		     (not (pred_5 ?v1))))


   (:action op_1
       :parameters (?v3 ?v6)
       :precondition  (and  (pred_2 ?v3) (pred_3 ?v6)
			    (pred_4 ?v3 ?v6) (pred_5 ?v6) (pred_6))
       :effect (and (pred_1 ?v3)
		    (not (pred_4 ?v3 ?v6)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v3  ?v6)
       :precondition  (and  (pred_2 ?v3) (pred_3 ?v6)
			    (pred_1 ?v3) (pred_5 ?v6))
       :effect (and (pred_4 ?v3 ?v6)
		    (pred_6)
		    (not (pred_1 ?v3)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_01 obj_03 obj_05 obj_08 obj_02 obj_07 
          obj_06 obj_04 obj_09 
)
(:init
(pred_3 obj_01)
(pred_3 obj_03)
(pred_3 obj_05)
(pred_3 obj_08)
(pred_3 obj_02)
(pred_3 obj_07)
(pred_2 obj_06)
(pred_2 obj_04)
(pred_2 obj_09)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(pred_6)
(pred_4 obj_06 obj_07)
(pred_4 obj_04 obj_05)
(pred_4 obj_09 obj_08)
(pred_5 obj_05)
)
(:goal
(and
(pred_4 obj_06 obj_08)
(pred_4 obj_04 obj_01)
(pred_4 obj_09 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_06 obj_08) (pred_5 obj_01))
    (sometime-before  (pred_4 obj_04 obj_01) (pred_5 obj_03))
    (sometime-before  (pred_4 obj_09 obj_05) (pred_5 obj_01))
  )
)
)

; plan
1. (op_3 obj_05 obj_07)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_07)
   goals met: 0 of 3
2. (op_1 obj_06 obj_07)
   deleted: (pred_4 obj_06 obj_07) (pred_6)
   added: (pred_1 obj_06)
   goals met: 0 of 3
3. (op_3 obj_07 obj_03)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_03)
   goals met: 0 of 3
4. (op_2 obj_06 obj_03)
   deleted: (pred_1 obj_06)
   added: (pred_4 obj_06 obj_03) (pred_6)
   goals met: 0 of 3
5. (op_3 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_05)
   goals met: 0 of 3
6. (op_1 obj_04 obj_05)
   deleted: (pred_4 obj_04 obj_05) (pred_6)
   added: (pred_1 obj_04)
   goals met: 0 of 3
7. (op_3 obj_05 obj_01)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_01)
   goals met: 0 of 3
8. (op_2 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_4 obj_04 obj_01) (pred_6)
   goals met: 1 of 3
9. (op_3 obj_01 obj_08)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_08)
   goals met: 1 of 3
10. (op_1 obj_09 obj_08)
   deleted: (pred_4 obj_09 obj_08) (pred_6)
   added: (pred_1 obj_09)
   goals met: 1 of 3
11. (op_3 obj_08 obj_05)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_05)
   goals met: 1 of 3
12. (op_2 obj_09 obj_05)
   deleted: (pred_1 obj_09)
   added: (pred_4 obj_09 obj_05) (pred_6)
   goals met: 2 of 3
13. (op_3 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 2 of 3
14. (op_1 obj_06 obj_03)
   deleted: (pred_4 obj_06 obj_03) (pred_6)
   added: (pred_1 obj_06)
   goals met: 2 of 3
15. (op_3 obj_03 obj_08)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_08)
   goals met: 2 of 3
16. (op_2 obj_06 obj_08)
   deleted: (pred_1 obj_06)
   added: (pred_4 obj_06 obj_08) (pred_6)
   goals met: 3 of 3
